Validation_Cases/3D_Bump/Fine_negSA/system/fieldAvg
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

fieldAvg1
{
    type            fieldAverage;
    libs            (fieldFunctionObjects);
    writeControl    writeTime;

    fields
    (
        U
        {
            mean            yes;
            prime2Mean      yes;
            base            time;
        }
    );

    log         yes;

}







// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //